<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
  <dict>
    <key>Description</key>
    <string>Import Pritunl OpenVPN client in to Munki.</string>
    <key>Identifier</key>
    <string>com.github.aaronburchfield.munki.pritunl</string>
    <key>Input</key>
    <dict>
      <key>NAME</key>
      <string>Pritunl</string>
      <key>pkginfo</key>
      <dict>
        <key>name</key>
        <string>%NAME%</string>
        <key>description</key>
        <string>Connect to OpenVPN servers with a free, open source and secure client.</string>
        <key>display_name</key>
        <string>%NAME%</string>
        <key>catalogs</key>
        <array>
          <string>testing</string>
        </array>
        <key>category</key>
        <string>Utilities</string>
        <key>unattended_install</key>
        <true/>
      </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.1</string>
    <key>ParentRecipe</key>
    <string>com.github.aaronburchfield.pkg.pritunl</string>
    <key>Process</key>
    <array>
      <dict>
        <key>Processor</key>
        <string>MunkiImporter</string>
        <key>Arguments</key>
        <dict>
          <key>repo_subdirectory</key>
          <string>apps</string>
          <key>pkg_path</key>
          <string>%RECIPE_CACHE_DIR%/pkg/Pritunl.pkg</string>
        </dict>
      </dict>
    </array>
  </dict>
</plist>
