<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
  <dict>
    <key>Description</key>
    <string>Create installer package for Pritunl OpenVPN client.</string>
    <key>Identifier</key>
    <string>com.github.aaronburchfield.pkg.pritunl</string>
    <key>Input</key>
    <dict>
      <key>NAME</key>
      <string>Pritunl</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.1</string>
    <key>ParentRecipe</key>
    <string>com.github.aaronburchfield.download.pritunl</string>
    <key>Process</key>
    <array>
      <dict>
        <key>Processor</key>
        <string>Unarchiver</string>
        <key>Arguments</key>
        <dict>
          <key>destination_path</key>
          <string>%RECIPE_CACHE_DIR%/pkg</string>
        </dict>
      </dict>
      <dict>
        <key>Processor</key>
        <string>CodeSignatureVerifier</string>
        <key>Arguments</key>
        <dict>
          <key>input_path</key>
          <string>%RECIPE_CACHE_DIR%/pkg/Pritunl.pkg</string>
          <key>expected_authority_names</key>
          <array>
            <string>Developer ID Installer: Zachary Huff (73CNTLZRFJ)</string>
            <string>Developer ID Certification Authority</string>
            <string>Apple Root CA</string>
          </array>
        </dict>
      </dict>
    </array>
  </dict>
</plist>
