<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
  <dict>
    <key>Description</key>
    <string>Import the latest version of Discord into Munki.</string>
    <key>Identifier</key>
    <string>com.github.aaronburchfield.munki.discord</string>
    <key>Input</key>
    <dict>
      <key>NAME</key>
      <string>Discord</string>
      <key>MUNKI_REPO_SUBDIR</key>
      <string>apps</string>
      <key>pkginfo</key>
      <dict>
        <key>catalogs</key>
        <array>
          <string>testing</string>
        </array>
        <key>description</key>
        <string>
        </string>
        <key>display_name</key>
        <string>Discord</string>
        <key>name</key>
        <string>%NAME%</string>
        <key>unattended_install</key>
        <true/>
      </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.aaronburchfield.download.discord</string>
    <key>Process</key>
    <array>
      <!-- <dict>
      <key>Processor</key>
      <string>MunkiPkginfoMerger</string>
    </dict> -->
    <dict>
      <key>Arguments</key>
      <dict>
        <key>pkg_path</key>
        <string>%pathname%</string>
        <key>repo_subdirectory</key>
        <string>%MUNKI_REPO_SUBDIR%</string>
      </dict>
      <key>Processor</key>
      <string>MunkiImporter</string>
    </dict>
  </array>
</dict>
</plist>
