<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
  <dict>
    <key>Description</key>
    <string>Import the SaveHollywood Screensaver to Munki.</string>
    <key>Identifier</key>
    <string>com.github.aaronburchfield.munki.savehollywood</string>
    <key>Input</key>
    <dict>
      <key>NAME</key>
      <string>SaveHollywood</string>
      <key>MUNKI_REPO_SUBDIR</key>
      <string>apps</string>
      <key>pkginfo</key>
      <dict>
        <key>catalogs</key>
        <array>
          <string>testing</string>
        </array>
        <key>category</key>
        <string>Screensavers</string>
        <key>description</key>
        <string>SaveHollywood is a Screen Saver module for OS X 10.8 or later. It lets you play movies when your Mac enters screen saver mode.</string>
        <key>display_name</key>
        <string>SaveHollywood</string>
        <key>name</key>
        <string>%NAME%</string>
        <key>unattended_install</key>
        <true/>
      </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.aaronburchfield.download.savehollywood</string>
    <key>Process</key>
    <array>
      <dict>
        <key>Arguments</key>
        <dict>
          <key>pkg_path</key>
          <string>%pathname%</string>
          <key>repo_subdirectory</key>
          <string>%MUNKI_REPO_SUBDIR%</string>
          <key>additional_makepkginfo_options</key>
          <array>
            <string>--itemname=SaveHollywood.saver</string>
            <string>--destinationpath=/Library/Screen Savers</string>
            <string>--owner=root</string>
            <string>--group=wheel</string>
          </array>
        </dict>
        <key>Processor</key>
        <string>MunkiImporter</string>
      </dict>
    </array>
  </dict>
</plist>
