<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
  <dict>
    <key>Description</key>
    <string>Import the latest version of Keybase into Munki.</string>
    <key>Identifier</key>
    <string>com.github.aaronburchfield.munki.keybase</string>
    <key>Input</key>
    <dict>
      <key>NAME</key>
      <string>Keybase</string>
      <key>MUNKI_REPO_SUBDIR</key>
      <string>apps</string>
      <key>pkginfo</key>
      <dict>
        <key>catalogs</key>
        <array>
          <string>testing</string>
        </array>
        <key>category</key>
        <string>Security</string>
        <key>description</key>
        <string>Keys for everyone! Keybase maps your identity to your public keys, and vice versa.</string>
        <key>display_name</key>
        <string>Keybase</string>
        <key>name</key>
        <string>%NAME%</string>
        <key>unattended_install</key>
        <true/>
      </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.aaronburchfield.download.keybase</string>
    <key>Process</key>
    <array>
      <dict>
        <key>Arguments</key>
        <dict>
          <key>pkg_path</key>
          <string>%pathname%</string>
          <key>repo_subdirectory</key>
          <string>%MUNKI_REPO_SUBDIR%</string>
        </dict>
        <key>Processor</key>
        <string>MunkiImporter</string>
      </dict>
    </array>
  </dict>
</plist>
