<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
  <dict>
    <key>Description</key>
    <string>Download the latest version of Gqrx</string>
    <key>Identifier</key>
    <string>com.github.aaronburchfield.download.gqrx</string>
    <key>Input</key>
    <dict>
      <key>NAME</key>
      <string>Gqrx</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.1</string>
    <key>Process</key>
    <array>
      <dict>
        <key>Processor</key>
        <string>GitHubReleasesInfoProvider</string>
        <key>Arguments</key>
        <dict>
          <key>asset_regex</key>
          <string>^Gqrx-*.*?dmg$</string>
          <key>github_repo</key>
          <string>csete/gqrx</string>
        </dict>
      </dict>
      <dict>
        <key>Processor</key>
        <string>URLDownloader</string>
      </dict>
      <dict>
        <key>Processor</key>
        <string>EndOfCheckPhase</string>
      </dict>
    </array>
  </dict>
</plist>
